Revit 2015 API
CustomExporter Constructor
 Constructs a new instance of a CustomExporter for a given document using an input IExportContext to use during export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public CustomExporter(
	Document document,
	IExportContext IContext
)
Visual Basic
Public Sub New ( _
	document As Document, _
	IContext As IExportContext _
)
Visual C++
public:
CustomExporter(
	Document^ document,
	IExportContext^ IContext
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document containing the model to be exported
IContext
Type: Autodesk.Revit.DB.IExportContext
 An instance of a context class that will be consuming the output
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
CustomExporter Class
Autodesk.Revit.DB Namespace